{"cik":"0001846975","entityName":"SDCL EDGE ACQUISITION CORPORATION","facts":{"us-gaap":{"AccruedLiabilitiesCurrent":{"label":"Accrued Liabilities, Current","description":"Carrying value as of the balance sheet date of obligations incurred and payable, pertaining to costs that are statutory in nature, are incurred on contractual obligations, or accumulate over time and for which invoices have not yet been received or will not be rendered. Examples include taxes, interest, rent and utilities. Used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer).","units":{"USD":[{"end":"2021-09-30","val":415194,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q3I"}]}},"AdditionalPaidInCapital":{"label":"Additional Paid in Capital","description":"Excess of issue price over par or stated value of the entity's capital stock and amounts received from other transactions involving the entity's stock or stockholders. Includes adjustments to additional paid in capital. Some examples of such adjustments include recording the issuance of debt with a beneficial conversion feature and certain tax consequences of equity instruments awarded to employees. Use this element for the aggregate amount of additional paid-in capital associated with common and preferred stock. For additional paid-in capital associated with only common stock, use the element additional paid in capital, common stock. For additional paid-in capital associated with only preferred stock, use the element additional paid in capital, preferred stock.","units":{"USD":[{"end":"2021-09-30","val":24497,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q3I"}]}},"AntidilutiveSecuritiesExcludedFromComputationOfEarningsPerShareAmount":{"label":"Antidilutive Securities Excluded from Computation of Earnings Per Share, Amount","description":"Securities (including those issuable pursuant to contingent stock agreements) that could potentially dilute basic earnings per share (EPS) or earnings per unit (EPU) in the future that were not included in the computation of diluted EPS or EPU because to do so would increase EPS or EPU amounts or decrease loss per share or unit amounts for the period presented.","units":{"shares":[{"start":"2021-02-16","end":"2021-09-30","val":0,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13"}]}},"Assets":{"label":"Assets","description":"Sum of the carrying amounts as of the balance sheet date of all assets that are recognized. Assets are probable future economic benefits obtained or controlled by an entity as a result of past transactions or events.","units":{"USD":[{"end":"2021-09-30","val":778261,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q3I"}]}},"AssetsCurrent":{"label":"Assets, Current","description":"Sum of the carrying amounts as of the balance sheet date of all assets that are expected to be realized in cash, sold, or consumed within one year (or the normal operating cycle, if longer). Assets are probable future economic benefits obtained or controlled by an entity as a result of past transactions or events.","units":{"USD":[{"end":"2021-09-30","val":59087,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q3I"}]}},"BusinessCombinationStepAcquisitionEquityInterestInAcquireePercentage":{"label":"Business Combination, Step Acquisition, Equity Interest in Acquiree, Percentage","description":"Percentage of equity in the acquiree held by the acquirer immediately before the acquisition date in a business combination.","units":{"pure":[{"end":"2021-09-30","val":1,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q3I"}]}},"CashAndCashEquivalentsAtCarryingValue":{"label":"Cash and Cash Equivalents, at Carrying Value","description":"Amount of currency on hand as well as demand deposits with banks or financial institutions. Includes other kinds of accounts that have the general characteristics of demand deposits. Also includes short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates. Excludes cash and cash equivalents within disposal group and discontinued operation.","units":{"USD":[{"end":"2021-02-15","val":0,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q1I"},{"end":"2021-09-30","val":59087,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q3I"}]}},"CashCashEquivalentsRestrictedCashAndRestrictedCashEquivalentsPeriodIncreaseDecreaseExcludingExchangeRateEffect":{"label":"Cash, Cash Equivalents, Restricted Cash and Restricted Cash Equivalents, Period Increase (Decrease), Excluding Exchange Rate Effect","description":"Amount of increase (decrease) in cash and cash equivalents, and cash and cash equivalents restricted to withdrawal or usage; excluding effect from exchange rate change. Cash includes, but is not limited to, currency on hand, demand deposits with banks or financial institutions, and other accounts with general characteristics of demand deposits. Cash equivalents include, but are not limited to, short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates.","units":{"USD":[{"start":"2021-02-16","end":"2021-09-30","val":59087,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13"}]}},"CashEquivalentsAtCarryingValue":{"label":"Cash Equivalents, at Carrying Value","description":"Amount of short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates. Excludes cash and cash equivalents within disposal group and discontinued operation.","units":{"USD":[{"end":"2021-09-30","val":0,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q3I"}]}},"CashFDICInsuredAmount":{"label":"Cash, FDIC Insured Amount","description":"The amount of cash deposited in financial institutions as of the balance sheet date that is insured by the Federal Deposit Insurance Corporation.","units":{"USD":[{"end":"2021-09-30","val":250000,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q3I"}]}},"ClassOfWarrantOrRightExercisePriceOfWarrantsOrRights1":{"label":"Class of Warrant or Right, Exercise Price of Warrants or Rights","description":"Exercise price per share or per unit of warrants or rights outstanding.","units":{"USD/shares":[{"end":"2021-09-30","val":0.01,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q3I"}]}},"CommitmentsAndContingencies":{"label":"Commitments and Contingencies","description":"Represents the caption on the face of the balance sheet to indicate that the entity has entered into (1) purchase or supply arrangements that will require expending a portion of its resources to meet the terms thereof, and (2) is exposed to potential losses or, less frequently, gains, arising from (a) possible claims against a company's resources due to future performance under contract terms, and (b) possible losses or likely gains from uncertainties that will ultimately be resolved when one or more future events that are deemed likely to occur do occur or fail to occur.","units":{"USD":[{"end":"2021-09-30","val":0,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q3I"}]}},"DebtInstrumentFaceAmount":{"label":"Debt Instrument, Face Amount","description":"Face (par) amount of debt instrument at time of issuance.","units":{"USD":[{"end":"2021-09-30","val":300000,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q3I"}]}},"DeferredOfferingCosts":{"label":"Deferred Offering Costs","description":"Specific incremental costs directly attributable to a proposed or actual offering of securities which are deferred at the end of the reporting period.","units":{"USD":[{"end":"2021-09-30","val":719174,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q3I"}]}},"DueToRelatedPartiesCurrent":{"label":"Due to Related Parties, Current","description":"Carrying amount as of the balance sheet date of obligations due all related parties. For classified balance sheets, represents the current portion of such liabilities (due within one year or within the normal operating cycle if longer).","units":{"USD":[{"end":"2021-09-30","val":300000,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q3I"}]}},"EarningsPerShareBasicAndDiluted":{"label":"Earnings Per Share, Basic and Diluted","description":"The amount of net income or loss for the period per each share in instances when basic and diluted earnings per share are the same amount and reported as a single line item on the face of the financial statements. Basic earnings per share is the amount of net income or loss for the period per each share of common stock or unit outstanding during the reporting period. Diluted earnings per share includes the amount of net income or loss for the period available to each share of common stock or common unit outstanding during the reporting period and to each share or unit that would have been outstanding assuming the issuance of common shares or units for all dilutive potential common shares or units outstanding during the reporting period.","units":{"USD/shares":[{"start":"2021-02-16","end":"2021-09-30","val":0,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13"},{"start":"2021-07-01","end":"2021-09-30","val":0,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q3"}]}},"Liabilities":{"label":"Liabilities","description":"Sum of the carrying amounts as of the balance sheet date of all liabilities that are recognized. Liabilities are probable future sacrifices of economic benefits arising from present obligations of an entity to transfer assets or provide services to other entities in the future.","units":{"USD":[{"end":"2021-09-30","val":762908,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q3I"}]}},"LiabilitiesAndStockholdersEquity":{"label":"Liabilities and Equity","description":"Amount of liabilities and equity items, including the portion of equity attributable to noncontrolling interests, if any.","units":{"USD":[{"end":"2021-09-30","val":778261,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q3I"}]}},"NetCashProvidedByUsedInFinancingActivities":{"label":"Net Cash Provided by (Used in) Financing Activities","description":"Amount of cash inflow (outflow) from financing activities, including discontinued operations. Financing activity cash flows include obtaining resources from owners and providing them with a return on, and a return of, their investment; borrowing money and repaying amounts borrowed, or settling the obligation; and obtaining and paying for other resources obtained from creditors on long-term credit.","units":{"USD":[{"start":"2021-02-16","end":"2021-09-30","val":59087,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13"}]}},"NetCashProvidedByUsedInOperatingActivities":{"label":"Net Cash Provided by (Used in) Operating Activities","description":"Amount of cash inflow (outflow) from operating activities, including discontinued operations. Operating activity cash flows include transactions, adjustments, and changes in value not defined as investing or financing activities.","units":{"USD":[{"start":"2021-02-16","end":"2021-09-30","val":0,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13"}]}},"NetIncomeLoss":{"label":"Net Income (Loss) Attributable to Parent","description":"The portion of profit or loss for the period, net of income taxes, which is attributable to the parent.","units":{"USD":[{"start":"2021-02-16","end":"2021-09-30","val":-9647,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13"},{"start":"2021-07-01","end":"2021-09-30","val":0,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q3"}]}},"OperatingExpenses":{"label":"Operating Expenses","description":"Generally recurring costs associated with normal operations except for the portion of these expenses which can be clearly related to production and included in cost of sales or services. Includes selling, general and administrative expense.","units":{"USD":[{"start":"2021-02-16","end":"2021-09-30","val":9647,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13"},{"start":"2021-07-01","end":"2021-09-30","val":0,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q3"}]}},"PaymentsForRent":{"label":"Payments for Rent","description":"Cash payments to lessor's for use of assets under operating leases.","units":{"USD":[{"start":"2021-02-16","end":"2021-09-30","val":20000,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13"}]}},"PreferredStockParOrStatedValuePerShare":{"label":"Preferred Stock, Par or Stated Value Per Share","description":"Face amount or stated value per share of preferred stock nonredeemable or redeemable solely at the option of the issuer.","units":{"USD/shares":[{"end":"2021-09-30","val":0.0001,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q3I"}]}},"PreferredStockSharesAuthorized":{"label":"Preferred Stock, Shares Authorized","description":"The maximum number of nonredeemable preferred shares (or preferred stock redeemable solely at the option of the issuer) permitted to be issued by an entity's charter and bylaws.","units":{"shares":[{"end":"2021-09-30","val":5000000,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q3I"}]}},"PreferredStockSharesIssued":{"label":"Preferred Stock, Shares Issued","description":"Total number of nonredeemable preferred shares (or preferred stock redeemable solely at the option of the issuer) issued to shareholders (includes related preferred shares that were issued, repurchased, and remain in the treasury). May be all or portion of the number of preferred shares authorized. Excludes preferred shares that are classified as debt.","units":{"shares":[{"end":"2021-09-30","val":0,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q3I"}]}},"PreferredStockSharesOutstanding":{"label":"Preferred Stock, Shares Outstanding","description":"Aggregate share number for all nonredeemable preferred stock (or preferred stock redeemable solely at the option of the issuer) held by stockholders. Does not include preferred shares that have been repurchased.","units":{"shares":[{"end":"2021-09-30","val":0,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q3I"}]}},"PreferredStockValue":{"label":"Preferred Stock, Value, Issued","description":"Aggregate par or stated value of issued nonredeemable preferred stock (or preferred stock redeemable solely at the option of the issuer). This item includes treasury stock repurchased by the entity. Note: elements for number of nonredeemable preferred shares, par value and other disclosure concepts are in another section within stockholders' equity.","units":{"USD":[{"end":"2021-09-30","val":0,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q3I"}]}},"ProceedsFromOtherShortTermDebt":{"label":"Proceeds from Other Short-term Debt","description":"Amount of cash inflow from short-term debt classified as other.","units":{"USD":[{"start":"2021-02-16","end":"2021-09-30","val":15876,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13"}]}},"ProfitLoss":{"label":"Net Income (Loss), Including Portion Attributable to Noncontrolling Interest","description":"The consolidated profit or loss for the period, net of income taxes, including the portion attributable to the noncontrolling interest.","units":{"USD":[{"start":"2021-02-16","end":"2021-03-31","val":-9647,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q1I"}]}},"RetainedEarningsAccumulatedDeficit":{"label":"Retained Earnings (Accumulated Deficit)","description":"The cumulative amount of the reporting entity's undistributed earnings or deficit.","units":{"USD":[{"end":"2021-09-30","val":-9647,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q3I"}]}},"StockholdersEquity":{"label":"Stockholders' Equity Attributable to Parent","description":"Total of all stockholders' equity (deficit) items, net of receivables from officers, directors, owners, and affiliates of the entity which are attributable to the parent. The amount of the economic entity's stockholders' equity attributable to the parent excludes the amount of stockholders' equity which is allocable to that ownership interest in subsidiary equity which is not attributable to the parent (noncontrolling interest, minority interest). This excludes temporary equity and is sometimes called permanent equity.","units":{"USD":[{"end":"2021-03-31","val":15353,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q1I"},{"end":"2021-06-30","val":15353,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q2I"},{"end":"2021-09-30","val":15353,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q3I"}]}},"StockIssuedDuringPeriodValueOther":{"label":"Stock Issued During Period, Value, Other","description":"Value of shares of stock issued attributable to transactions classified as other.","units":{"USD":[{"start":"2021-02-16","end":"2021-03-31","val":25000,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q1I"}]}},"UnrecognizedTaxBenefits":{"label":"Unrecognized Tax Benefits","description":"Amount of unrecognized tax benefits.","units":{"USD":[{"end":"2021-09-30","val":0,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q3I"}]}},"WeightedAverageNumberOfShareOutstandingBasicAndDiluted":{"label":"Weighted Average Number of Shares Outstanding, Basic and Diluted","description":"Average number of shares or units issued and outstanding that are used in calculating basic and diluted earnings per share (EPS).","units":{"shares":[{"start":"2021-02-16","end":"2021-09-30","val":4375000,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13"},{"start":"2021-07-01","end":"2021-09-30","val":4375000,"accn":"0001829126-21-016271","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-12-13","frame":"CY2021Q3"}]}}}}}