{"cik":"0001852736","entityName":"Tristar Acquisition I Corp.","facts":{"us-gaap":{"AccountsPayableAndAccruedLiabilitiesCurrent":{"label":"Accounts Payable and Accrued Liabilities, Current","description":"Sum of the carrying values as of the balance sheet date of obligations incurred through that date and due within one year (or the operating cycle, if longer), including liabilities incurred (and for which invoices have typically been received) and payable to vendors for goods and services received, taxes, interest, rent and utilities, accrued salaries and bonuses, payroll taxes and fringe benefits.","units":{"USD":[{"end":"2021-09-30","val":538973,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3I"}]}},"AdditionalPaidInCapital":{"label":"Additional Paid in Capital","description":"Excess of issue price over par or stated value of the entity's capital stock and amounts received from other transactions involving the entity's stock or stockholders. Includes adjustments to additional paid in capital. Some examples of such adjustments include recording the issuance of debt with a beneficial conversion feature and certain tax consequences of equity instruments awarded to employees. Use this element for the aggregate amount of additional paid-in capital associated with common and preferred stock. For additional paid-in capital associated with only common stock, use the element additional paid in capital, common stock. For additional paid-in capital associated with only preferred stock, use the element additional paid in capital, preferred stock.","units":{"USD":[{"end":"2021-09-30","val":24425,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3I"}]}},"Assets":{"label":"Assets","description":"Sum of the carrying amounts as of the balance sheet date of all assets that are recognized. Assets are probable future economic benefits obtained or controlled by an entity as a result of past transactions or events.","units":{"USD":[{"end":"2021-09-30","val":663160,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3I"}]}},"AssetsCurrent":{"label":"Assets, Current","description":"Sum of the carrying amounts as of the balance sheet date of all assets that are expected to be realized in cash, sold, or consumed within one year (or the normal operating cycle, if longer). Assets are probable future economic benefits obtained or controlled by an entity as a result of past transactions or events.","units":{"USD":[{"end":"2021-09-30","val":15771,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3I"}]}},"Cash":{"label":"Cash","description":"Amount of currency on hand as well as demand deposits with banks or financial institutions. Includes other kinds of accounts that have the general characteristics of demand deposits. Excludes cash and cash equivalents within disposal group and discontinued operation.","units":{"USD":[{"end":"2021-03-04","val":0,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q1I"},{"end":"2021-09-30","val":821,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3I"}]}},"CashAndCashEquivalentsPeriodIncreaseDecrease":{"label":"Cash and Cash Equivalents, Period Increase (Decrease)","description":"Amount of increase (decrease) in cash and cash equivalents. Cash and cash equivalents are the amount of currency on hand as well as demand deposits with banks or financial institutions. Includes other kinds of accounts that have the general characteristics of demand deposits. Also includes short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates. Includes effect from exchange rate changes.","units":{"USD":[{"start":"2021-03-05","end":"2021-09-30","val":821,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29"}]}},"CashEquivalentsAtCarryingValue":{"label":"Cash Equivalents, at Carrying Value","description":"Amount of short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates. Excludes cash and cash equivalents within disposal group and discontinued operation.","units":{"USD":[{"end":"2021-09-30","val":0,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3I"}]}},"CashFDICInsuredAmount":{"label":"Cash, FDIC Insured Amount","description":"The amount of cash deposited in financial institutions as of the balance sheet date that is insured by the Federal Deposit Insurance Corporation.","units":{"USD":[{"end":"2021-09-30","val":250000,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3I"}]}},"ClassOfWarrantOrRightOutstanding":{"label":"Class of Warrant or Right, Outstanding","description":"Number of warrants or rights outstanding.","units":{"shares":[{"end":"2021-09-30","val":18845000,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3I"}]}},"DilutiveSecurities":{"label":"Dilutive Securities, Effect on Basic Earnings Per Share","description":"Amount of increase (decrease) to net income used for calculating diluted earnings per share (EPS), resulting from the assumed exercise stock options, restrictive stock units (RSUs), convertible preferred stock of an employee stock ownership plan (ESOP), and other dilutive convertible securities.","units":{"USD":[{"start":"2021-03-05","end":"2021-09-30","val":0,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29"}]}},"EarningsPerShareBasicAndDiluted":{"label":"Earnings Per Share, Basic and Diluted","description":"The amount of net income or loss for the period per each share in instances when basic and diluted earnings per share are the same amount and reported as a single line item on the face of the financial statements. Basic earnings per share is the amount of net income or loss for the period per each share of common stock or unit outstanding during the reporting period. Diluted earnings per share includes the amount of net income or loss for the period available to each share of common stock or common unit outstanding during the reporting period and to each share or unit that would have been outstanding assuming the issuance of common shares or units for all dilutive potential common shares or units outstanding during the reporting period.","units":{"USD/shares":[{"start":"2021-03-05","end":"2021-09-30","val":-0.03,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29"},{"start":"2021-07-01","end":"2021-09-30","val":-0.01,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3"}]}},"GeneralAndAdministrativeExpense":{"label":"General and Administrative Expense","description":"The aggregate total of expenses of managing and administering the affairs of an entity, including affiliates of the reporting entity, which are not directly or indirectly associated with the manufacture, sale or creation of a product or product line.","units":{"USD":[{"start":"2021-03-05","end":"2021-09-30","val":153530,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29"},{"start":"2021-07-01","end":"2021-09-30","val":32464,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3"}]}},"IncomeTaxExpenseBenefit":{"label":"Income Tax Expense (Benefit)","description":"Amount of current income tax expense (benefit) and deferred income tax expense (benefit) pertaining to continuing operations.","units":{"USD":[{"start":"2021-03-05","end":"2021-09-30","val":0,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29"}]}},"IncreaseDecreaseInAccountsPayableAndAccruedLiabilities":{"label":"Increase (Decrease) in Accounts Payable and Accrued Liabilities","description":"The increase (decrease) during the reporting period in the amounts payable to vendors for goods and services received and the amount of obligations and expenses incurred but not paid.","units":{"USD":[{"start":"2021-03-05","end":"2021-09-30","val":6381,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29"}]}},"IncreaseDecreaseInPrepaidExpense":{"label":"Increase (Decrease) in Prepaid Expense","description":"The increase (decrease) during the reporting period in the amount of outstanding money paid in advance for goods or services that bring economic benefits for future periods.","units":{"USD":[{"start":"2021-03-05","end":"2021-09-30","val":14950,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29"}]}},"Liabilities":{"label":"Liabilities","description":"Sum of the carrying amounts as of the balance sheet date of all liabilities that are recognized. Liabilities are probable future sacrifices of economic benefits arising from present obligations of an entity to transfer assets or provide services to other entities in the future.","units":{"USD":[{"end":"2021-09-30","val":791690,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3I"}]}},"LiabilitiesAndStockholdersEquity":{"label":"Liabilities and Equity","description":"Amount of liabilities and equity items, including the portion of equity attributable to noncontrolling interests, if any.","units":{"USD":[{"end":"2021-09-30","val":663160,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3I"}]}},"LiabilitiesAssumed1":{"label":"Liabilities Assumed","description":"The fair value of liabilities assumed in noncash investing or financing activities.","units":{"USD":[{"start":"2021-03-05","end":"2021-09-30","val":532592,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29"}]}},"LiquidationBasisOfAccountingAccruedCostsToDisposeOfAssetsAndLiabilities":{"label":"Liquidation Basis of Accounting, Accrued Costs to Dispose of Assets and Liabilities","description":"Amount of estimated accrued costs to dispose of assets or other items expected to be sold in liquidation.","units":{"USD":[{"end":"2021-09-30","val":100000,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3I"}]}},"MinimumNetWorthRequiredForCompliance":{"label":"Minimum Net Worth Required for Compliance","description":"The lowest amount of net worth (total assets minus total liabilities) required by secondary market investors or state-imposed regulatory mandates.","units":{"USD":[{"end":"2021-09-30","val":5000001,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3I"}]}},"NetCashProvidedByUsedInFinancingActivities":{"label":"Net Cash Provided by (Used in) Financing Activities","description":"Amount of cash inflow (outflow) from financing activities, including discontinued operations. Financing activity cash flows include obtaining resources from owners and providing them with a return on, and a return of, their investment; borrowing money and repaying amounts borrowed, or settling the obligation; and obtaining and paying for other resources obtained from creditors on long-term credit.","units":{"USD":[{"start":"2021-03-05","end":"2021-09-30","val":162920,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29"}]}},"NetCashProvidedByUsedInOperatingActivities":{"label":"Net Cash Provided by (Used in) Operating Activities","description":"Amount of cash inflow (outflow) from operating activities, including discontinued operations. Operating activity cash flows include transactions, adjustments, and changes in value not defined as investing or financing activities.","units":{"USD":[{"start":"2021-03-05","end":"2021-09-30","val":-162099,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29"}]}},"NetIncomeLoss":{"label":"Net Income (Loss) Attributable to Parent","description":"The portion of profit or loss for the period, net of income taxes, which is attributable to the parent.","units":{"USD":[{"start":"2021-03-05","end":"2021-06-30","val":-121066,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q2"},{"start":"2021-03-05","end":"2021-09-30","val":-153530,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29"},{"start":"2021-07-01","end":"2021-09-30","val":-32464,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3"}]}},"NotesPayableRelatedPartiesClassifiedCurrent":{"label":"Notes Payable, Related Parties, Current","description":"The amount for notes payable (written promise to pay), due to related parties. Used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer).","units":{"USD":[{"end":"2021-09-30","val":252717,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3I"}]}},"PaymentsOfStockIssuanceCosts":{"label":"Payments of Stock Issuance Costs","description":"The cash outflow for cost incurred directly with the issuance of an equity security.","units":{"USD":[{"start":"2021-03-05","end":"2021-09-30","val":114797,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29"}]}},"PreferredStockParOrStatedValuePerShare":{"label":"Preferred Stock, Par or Stated Value Per Share","description":"Face amount or stated value per share of preferred stock nonredeemable or redeemable solely at the option of the issuer.","units":{"USD/shares":[{"end":"2021-09-30","val":0.0001,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3I"}]}},"PreferredStockSharesAuthorized":{"label":"Preferred Stock, Shares Authorized","description":"The maximum number of nonredeemable preferred shares (or preferred stock redeemable solely at the option of the issuer) permitted to be issued by an entity's charter and bylaws.","units":{"shares":[{"end":"2021-09-30","val":1000000,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3I"}]}},"PreferredStockSharesIssued":{"label":"Preferred Stock, Shares Issued","description":"Total number of nonredeemable preferred shares (or preferred stock redeemable solely at the option of the issuer) issued to shareholders (includes related preferred shares that were issued, repurchased, and remain in the treasury). May be all or portion of the number of preferred shares authorized. Excludes preferred shares that are classified as debt.","units":{"shares":[{"end":"2021-09-30","val":0,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3I"}]}},"PreferredStockSharesOutstanding":{"label":"Preferred Stock, Shares Outstanding","description":"Aggregate share number for all nonredeemable preferred stock (or preferred stock redeemable solely at the option of the issuer) held by stockholders. Does not include preferred shares that have been repurchased.","units":{"shares":[{"end":"2021-09-30","val":0,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3I"}]}},"PrepaidExpenseCurrent":{"label":"Prepaid Expense, Current","description":"Amount of asset related to consideration paid in advance for costs that provide economic benefits within a future period of one year or the normal operating cycle, if longer.","units":{"USD":[{"end":"2021-09-30","val":14950,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3I"}]}},"ProceedsFromIssuanceOfCommonStock":{"label":"Proceeds from Issuance of Common Stock","description":"The cash inflow from the additional capital contribution to the entity.","units":{"USD":[{"start":"2021-03-05","end":"2021-09-30","val":25000,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29"}]}},"ProceedsFromRelatedPartyDebt":{"label":"Proceeds from Related Party Debt","description":"The cash inflow from a long-term borrowing made from related parties where one party can exercise control or significant influence over another party; including affiliates, owners or officers and their immediate families, pension trusts, and so forth. Alternate caption: Proceeds from Advances from Affiliates.","units":{"USD":[{"start":"2021-03-05","end":"2021-09-30","val":252717,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29"}]}},"RetainedEarningsAccumulatedDeficit":{"label":"Retained Earnings (Accumulated Deficit)","description":"The cumulative amount of the reporting entity's undistributed earnings or deficit.","units":{"USD":[{"end":"2021-09-30","val":-153530,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3I"}]}},"StockholdersEquity":{"label":"Stockholders' Equity Attributable to Parent","description":"Total of all stockholders' equity (deficit) items, net of receivables from officers, directors, owners, and affiliates of the entity which are attributable to the parent. The amount of the economic entity's stockholders' equity attributable to the parent excludes the amount of stockholders' equity which is allocable to that ownership interest in subsidiary equity which is not attributable to the parent (noncontrolling interest, minority interest). This excludes temporary equity and is sometimes called permanent equity.","units":{"USD":[{"end":"2021-03-04","val":0,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q1I"},{"end":"2021-06-30","val":-96066,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q2I"},{"end":"2021-09-30","val":-128530,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3I"}]}},"StockIssuedDuringPeriodValueIssuedForServices":{"label":"Stock Issued During Period, Value, Issued for Services","description":"Value of stock issued in lieu of cash for services contributed to the entity. Value of the stock issued includes, but is not limited to, services contributed by vendors and founders.","units":{"USD":[{"start":"2021-03-05","end":"2021-06-30","val":25000,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q2"}]}},"TemporaryEquityLiquidationPreferencePerShare":{"label":"Temporary Equity, Liquidation Preference Per Share","description":"The per share liquidation preference (or restrictions) of stock classified as temporary equity that has a preference in involuntary liquidation considerably in excess of the par or stated value of the shares. The liquidation preference is the difference between the preference in liquidation and the par or stated values of the share. Temporary equity is a security with redemption features that are outside the control of the issuer, is not classified as an asset or liability in conformity with GAAP, and is not mandatorily redeemable. Includes any type of security that is redeemable at a fixed or determinable price or on a fixed or determinable date or dates, is redeemable at the option of the holder, or has conditions for redemption which are not solely within the control of the issuer. If convertible, the issuer does not control the actions or events necessary to issue the maximum number of shares that could be required to be delivered under the conversion option if the holder exercises the option to convert the stock to another class of equity. If the security is a warrant or a rights issue, the warrant or rights issue is considered to be temporary equity if the issuer cannot demonstrate that it would be able to deliver upon the exercise of the option by the holder in all cases. Includes stock with put option held by ESOP and stock redeemable by holder only in the event of a change in control of the issuer.","units":{"USD/shares":[{"end":"2021-09-30","val":10.1,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3I"}]}},"TemporaryEquityRedemptionPricePerShare":{"label":"Temporary Equity, Redemption Price Per Share","description":"Amount to be paid per share that is classified as temporary equity by entity upon redemption. Temporary equity is a security with redemption features that are outside the control of the issuer, is not classified as an asset or liability in conformity with GAAP, and is not mandatorily redeemable. Includes any type of security that is redeemable at a fixed or determinable price or on a fixed or determinable date or dates, is redeemable at the option of the holder, or has conditions for redemption which are not solely within the control of the issuer. If convertible, the issuer does not control the actions or events necessary to issue the maximum number of shares that could be required to be delivered under the conversion option if the holder exercises the option to convert the stock to another class of equity. If the security is a warrant or a rights issue, the warrant or rights issue is considered to be temporary equity if the issuer cannot demonstrate that it would be able to deliver upon the exercise of the option by the holder in all cases. Includes stock with put option held by ESOP and stock redeemable by holder only in the event of a change in control of the issuer.","units":{"USD/shares":[{"end":"2021-09-30","val":10.1,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3I"}]}},"UnrecognizedTaxBenefits":{"label":"Unrecognized Tax Benefits","description":"Amount of unrecognized tax benefits.","units":{"USD":[{"end":"2021-09-30","val":0,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3I"}]}},"UnrecognizedTaxBenefitsIncomeTaxPenaltiesAndInterestAccrued":{"label":"Unrecognized Tax Benefits, Income Tax Penalties and Interest Accrued","description":"Amount accrued for interest on an underpayment of income taxes and penalties related to a tax position claimed or expected to be claimed in the tax return.","units":{"USD":[{"end":"2021-09-30","val":0,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3I"}]}},"WeightedAverageNumberOfShareOutstandingBasicAndDiluted":{"label":"Weighted Average Number of Shares Outstanding, Basic and Diluted","description":"Average number of shares or units issued and outstanding that are used in calculating basic and diluted earnings per share (EPS).","units":{"shares":[{"start":"2021-03-05","end":"2021-09-30","val":5000000,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29"},{"start":"2021-07-01","end":"2021-09-30","val":5000000,"accn":"0001193125-21-342237","fy":2021,"fp":"Q3","form":"10-Q","filed":"2021-11-29","frame":"CY2021Q3"}]}}}}}